#### SE PIDE:
A partir del fichero ventas.csv diseña un modelo de base de datos relacional, almacénalo en
una base de datos SQLite y crea una tabla en la que se asocie cada cliente con su idioma.
Para ello:
1) Diseña el diagrama de la base de datos. Puedes elegir el nombre que prefieras para cada una de las tablas. Utiliza cualquier programa de edición de imágenes o la herramienta web https://dbdiagram.io/d

2) Crea una base de datos llamada karls.sqlite que contenga las tablas del modelo relacional con los datos correspondientes.

3) Accede a la base de datos world y construye la tabla que relacione cada cliente con su idioma. Añade esta tabla a la base de datos del paso anterior con el nombre deidiomas_cliente

In [1]:
# PEGAR png del diagrama

In [52]:
import pandas as pd
import sqlite3

df = pd.read_csv('./files/ventas.csv')

# Columnas para la tabla de productos
cols_productos = ['codigo_producto','precio_compra',
                 'nombre_producto','linea_productos', 'descr']

# Columnas para la tabla de ventas
cols_ventas = ['no_orden','codigo_producto','cantidad_orden',
               'precio_cada','fecha_orden','no_cliente']

# Columnas para la tabla de clientes
cols_clientes = ['no_cliente','nombre_cliente','tlf',
                 'direccion','estado','codigo_postal',
                 'pais']

# Creamos la base de datos sqlite
karls = sqlite3.connect('karls.sqlite')
cursor = karls.cursor()

# Incluimos las tablas en labase de datos
df[cols_productos].drop_duplicates().to_sql('productos', karls, index='False', if_exists='replace')
df[cols_ventas].drop_duplicates().to_sql('ventas', karls, index='False', if_exists='replace')
df[cols_clientes].drop_duplicates().to_sql('clientes', karls, index='False', if_exists='replace')

In [116]:
# Nos conectamos a la base de datos world para construir la tabla idiomaCliente
import pymysql
database_host = 'relational.fit.cvut.cz'
username = 'guest'
password = 'relational'
database_name = 'world'

# Abrir conexión con la base de datos
db = pymysql.connect(host=database_host, user=username, password=password, database=database_name)

query = '''
SELECT
    c.Name as pais,
    cl.Language as idioma,
    cl.IsOfficial,
    cl.Percentage
FROM Country c
JOIN CountryLanguage cl
ON c.Code = cl.CountryCode'''
pd.read_sql(query, db).head()

          pais      idioma IsOfficial  Percentage
0        Aruba       Dutch          T         5.3
1        Aruba     English          F         9.5
2        Aruba  Papiamento          F        76.7
3        Aruba     Spanish          F         7.4
4  Afghanistan     Balochi          F         0.9

In [125]:
# Se observa que un mismo país puede tener varios idiomas.
# Se decide usar el idioma con mayor porcentaje, independientemente de que sea oficial o no.
query = '''
SELECT
    cl.CountryCode,
    c.Name as pais,
    cl.Language as idioma,
    cl.Percentage
FROM Country c
JOIN CountryLanguage cl
ON c.Code = cl.CountryCode
WHERE (cl.CountryCode, cl.Percentage) IN
    (SELECT CountryCode, MAX(Percentage) as Percentage
     FROM CountryLanguage
     GROUP BY CountryCode)'''

temp = pd.read_sql(query, db)
temp.head()
print (len(temp))
print (len(temp[['pais']].drop_duplicates()))
temp.head()

241
233

  CountryCode         pais      idioma  Percentage
0         ABW        Aruba  Papiamento        76.7
1         AFG  Afghanistan      Pashto        52.4
2         AGO       Angola   Ovimbundu        37.2
3         AIA     Anguilla     English         0.0
4         ALB      Albania   Albaniana        97.9

In [126]:
# Parece que todavía hay países que aparecen dos veces o más
# Vamos a tratar de ver a que se debe

# ¿Qué paises son?

paises_2_id = list(temp.groupby(['CountryCode','pais'], as_index=0).count().sort_values('idioma', ascending=False).head(8)['CountryCode'])
temp.groupby(['CountryCode','pais'], as_index=0).count().sort_values('idioma', ascending=False).head(8)

    CountryCode                     pais  idioma  Percentage
152         NIU                     Niue       2           2
203         TKL                  Tokelau       2           2
35          CCK  Cocos (Keeling) Islands       2           2
205         TMP               East Timor       2           2
43          COK             Cook Islands       2           2
49          CXR         Christmas Island       2           2
226         WLF        Wallis and Futuna       2           2
183         SJM   Svalbard and Jan Mayen       2           2

In [129]:
# Buscamos a estos paises en la tabla CountryLanguage para saber su porcentajes de idiomas
query = '''
SELECT
    *
FROM CountryLanguage'''
temp = pd.read_sql(query, db)
temp[temp['CountryCode'].isin(paises_2_id)]

    CountryCode    Language IsOfficial  Percentage
149         CCK     English          T         0.0
150         CCK       Malay          F         0.0
200         COK     English          F         0.0
201         COK       Maori          T         0.0
219         CXR     Chinese          F         0.0
220         CXR     English          T         0.0
655         NIU     English          T         0.0
656         NIU        Niue          F         0.0
782         SJM   Norwegian          T         0.0
783         SJM     Russian          F         0.0
852         TKL     English          T         0.0
853         TKL     Tokelau          F         0.0
858         TMP  Portuguese          T         0.0
859         TMP       Sunda          F         0.0
950         WLF      Futuna          F         0.0
951         WLF      Wallis          F         0.0

In [134]:
# Todos esto paises tienen 0 en cualquier idioma
# Por tanto, se decide escoger el idioma oficial para estos paises

query = '''
SELECT
    cl.CountryCode,
    c.Name as pais,
    cl.Language as idioma,
    cl.Percentage
FROM Country c
JOIN CountryLanguage cl
ON c.Code = cl.CountryCode
WHERE (cl.CountryCode, cl.Percentage) IN
    (SELECT CountryCode, MAX(Percentage) as Percentage
     FROM CountryLanguage
     GROUP BY CountryCode)'''

idiomas_paises = pd.read_sql(query, db)
# Excluimos los paises repetidos
idiomas_paises = idiomas_paises[~idiomas_paises['CountryCode'].isin(paises_2_id)]

# realizamos otra query para quedarnos conel idioma oficial de los paises escluidos
query = '''
SELECT
    cl.CountryCode,
    c.Name as pais,
    cl.Language as idioma,
    cl.Percentage
FROM Country c
JOIN CountryLanguage cl
ON c.Code = cl.CountryCode
WHERE cl.IsOfficial = "T"'''
excluidos = pd.read_sql(query,db)
excluidos = excluidos[excluidos['CountryCode'].isin(paises_2_id)]

# Los concatenamos a la tabla de idiomas paises
idiomas_paises = pd.concat([idiomas_paises, excluidos])

# Comprobamos que ahora ya no hay paises duplicados
print (len(idiomas_paises))
print (len(idiomas_paises[['pais']].drop_duplicates()))

232
232

In [136]:
# Nos quedamos con las columnas necesarias y agregamos la tabla a la bases de datos sqlite
idiomas_paises[['pais','idioma']].to_sql('idiomaCliente', karls, index='False', if_exists='replace')

In [138]:
# Tablas de la base de datos
pd.read_sql('SELECT name FROM sqlite_master WHERE type="table"', karls)

            name
0      productos
1         ventas
2       clientes
3  idiomaCliente

##### OPCIONAL: Realiza una consulta SQL para conocer el producto que más beneficios genera.

In [144]:
query = '''
SELECT
    p.nombre_producto,
    v.imp_total_venta - (v.cantidad_vendida*p.precio_compra) as margen_total_producto
FROM (SELECT
          codigo_producto,
          sum(cantidad_orden) as cantidad_vendida,
          sum(cantidad_orden*precio_cada) as imp_total_venta
      FROM ventas
      GROUP BY codigo_producto) v
JOIN productos p
ON v.codigo_producto = p.codigo_producto
ORDER BY margen_total_producto DESC'''


pd.read_sql(query, karls)

                                 nombre_producto  margen_total_producto
0                    1992 Ferrari 360 Spider red              135996.78
1                       1952 Alpine Renault 1300               95282.58
2                              2001 Ferrari Enzo               93349.65
3           2003 Harley-Davidson Eagle Drag Bike               81031.30
4                              1968 Ford Mustang               72579.26
5                               1969 Ford Falcon               72399.77
6                         1928 Mercedes-Benz SSK               68423.18
7                               2002 Suzuki XREO               67641.47
8                    1980s Black Hawk Helicopter               64599.11
9                 1948 Porsche Type 356 Roadster               62725.78
10                      1917 Grand Touring Sedan               60945.00
11                     1957 Corvette Convertible               59910.22
12                      1962 Volkswagen Microbus               55655.47
13                         1976 Ford Gran Torino               54647.25
14                     1932 Model A Ford J-Coupe               54026.65
15                  1999 Indy 500 Monte Carlo SS               52240.32
16                             1903 Ford Model A               51219.92
17                             1957 Chevy Pickup               51127.01
18                        1940 Ford Pickup Truck               47291.45
19                            1969 Corvair Monza               46521.97
20                            1969 Dodge Charger               45950.46
21                                 ATA: B757-300               45058.29
22                                1958 Setra Bus               43366.45
23                               1982 Camaro Z28               42882.24
24                1998 Chrysler Plymouth Prowler               42441.77
25                             1997 BMW R 1100 S               42398.26
26                         1965 Aston Martin DB5               41490.69
27                         1996 Moto Guzzi 1100i               41077.81
28                            2002 Yamaha YZR M1               39774.00
29                           1972 Alfa Romeo GTA               39673.92
30                        1964 Mercedes Tour Bus               38842.08
31                         1961 Chevrolet Impala               38698.44
32         1969 Harley Davidson Ultimate Chopper               38565.60
33                                    HMS Bounty               37570.91
34                                   The Titanic               36354.57
35                               1993 Mazda RX-7               35564.15
36                         1970 Triumph Spitfire               35390.35
37                          1937 Lincoln Berline               35214.70
38                       1970 Plymouth Hemi Cuda               34761.95
39              Diamond T620 Semi-Skirted Tanker               34281.64
40                   1913 Ford Model T Speedster               34104.24
41           1932 Alfa Romeo 8C2300 Spider Sport               34063.06
42                     1974 Ducati 350 Mk3 Desmo               33634.50
43       1941 Chevrolet Special Deluxe Cabriolet               33049.37
44                              1995 Honda Civic               32953.82
45             1992 Porsche Cayenne Turbo Silver               32474.14
46                     American Airlines: MD-11S               32400.98
47                     The USS Constitution Ship               32047.73
48                         1936 Chrysler Airflow               31951.28
49                           2002 Chevy Corvette               31878.47
50                            1949 Jaguar XK 120               31829.77
51                       1900s Vintage Tri-Plane               31720.28
52                      Corsair F4U ( Bird Cage)               31433.33
53                         1926 Ford Fire Engine               30965.14
54                                The Queen Mary               30866.58
55                       1956 Porsche 356A Coupe               30829.11
56              1912 Ford Model T Delivery Wagon               30752.11
57                             1952 Citroen-15CV               30676.81
58                                 The Mayflower               30648.21
59                      1917 Maxwell Touring Car               30557.95
60           18th Century Vintage Horse Carriage               30237.39
61              1928 British Royal Navy Airplane               30014.09
62                     1937 Horch 930V Limousine               29554.55
63                      1960 BSA Gold Star DBD34               29313.69
64                            1968 Dodge Charger               29195.76
65                         18th century schooner               29181.38
66                   1980’s GM Manhattan Express               28937.59
67        1950's Chicago Surface Lines Streetcar               28835.51
68                      1928 Ford Phaeton Deluxe               28397.89
69                   American Airlines: B767-300               28143.12
70           1936 Harley Davidson El Knucklehead               27095.37
71                        1962 LanciaA Delta 16V               26735.57
72                      1940 Ford Delivery Sedan               26313.46
73                        1900s Vintage Bi-Plane               26239.07
74                           1904 Buick Runabout               25667.14
75                         The Schooner Bluenose               24699.11
76                              1940s Ford truck               24302.43
77                        1999 Yamaha Speed Boat               24271.98
78   1996 Peterbilt 379 Stake Bed with Outrigger               24075.81
79                         1957 Ford Thunderbird               23862.50
80                                P-51-D Mustang               23808.91
81                     1969 Chevrolet Camaro Z28               23413.60
82      1936 Mercedes-Benz 500K Special Roadster               22788.69
83                              1957 Vespa GS150               22425.82
84                   1954 Greyhound Scenicruiser               21708.15
85                America West Airlines B757-200               21648.60
86                              1997 BMW F650 ST               21508.01
87                            1934 Ford V8 Coupe               21337.46
88                       1939 Cadillac Limousine               21013.54
89                          1969 Dodge Super Bee               21009.23
90                      Collectable Wooden Train               20597.04
91                            F/A 18 Hornet 1/72               19661.60
92     1938 Cadillac V-16 Presidential Limousine               18766.54
93                            1970 Dodge Coronet               18662.33
94                            1911 Ford Town Car               17601.17
95                       1982 Lamborghini Diablo               16161.99
96           1958 Chevy Corvette Limited Edition               15988.43
97                1962 City of Detroit Streetcar               15908.47
98                                    Pont Yacht               15649.00
99                     1966 Shelby Cobra 427 S/C               15315.84
100                    1971 Alpine Renault 1600s               14955.51
101                  1948 Porsche 356-A Roadster               14064.82
102                   1970 Chevy Chevelle SS 454               13696.95
103                      1982 Ducati 900 Monster               13391.55
104                 1930 Buick Marquette Phaeton               12536.80
105             1936 Mercedes Benz 500k Roadster               11841.39
106                            1982 Ducati 996 R               11397.92
107                             Boeing X-32A JSF               11233.33
108                  1939 Chevrolet Deluxe Coupe                6904.85